DISTORTEC/distortos/source/chip/STMicroelectronics/STM32F4/STM32F4-chipVectors.c
// 0x0cc, 35: SPI1
__attribute__ ((weak)) void SPI1_IRQHandler(void)
{
	while (1);
}

// 0x0d0, 36: SPI2
__attribute__ ((weak)) void SPI2_IRQHandler(void)
{
	while (1);
}

// 0x0d4, 37: USART1
__attribute__ ((weak)) void USART1_IRQHandler(void)
{
	while (1);
}

// 0x0d8, 38: USART2
__attribute__ ((weak)) void USART2_IRQHandler(void)
{
	while (1);
}

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

// 0x0dc, 39: Reserved
__attribute__ ((weak)) void __Reserved_0xdc_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x0dc, 39: USART3
__attribute__ ((weak)) void USART3_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x0e0, 40: EXTI Lines [15:10]
__attribute__ ((weak)) void EXTI15_10_IRQHandler(void)
{
	while (1);
}

// 0x0e4, 41: RTC Alarm (A and B) through the EXTI line
__attribute__ ((weak)) void RTC_Alarm_IRQHandler(void)
{
	while (1);
}

#if defined(STM32F410_VECTORS)

// 0x0e8, 42: Reserved
__attribute__ ((weak)) void __Reserved_0xe8_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F410_VECTORS)

// 0x0e8, 42: USB OTG FS Wakeup through the EXTI line
__attribute__ ((weak)) void OTG_FS_WKUP_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

// 0x0ec, 43: Reserved
__attribute__ ((weak)) void __Reserved_0xec_Handler(void)
{
	while (1);
}

// 0x0f0, 44: Reserved
__attribute__ ((weak)) void __Reserved_0xf0_Handler(void)
{
	while (1);
}

// 0x0f4, 45: Reserved
__attribute__ ((weak)) void __Reserved_0xf4_Handler(void)
{
	while (1);
}

// 0x0f8, 46: Reserved
__attribute__ ((weak)) void __Reserved_0xf8_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x0ec, 43: TIM8 Break and TIM12
__attribute__ ((weak)) void TIM8_BRK_TIM12_IRQHandler(void)
{
	while (1);
}

// 0x0f0, 44: TIM8 Update and TIM13
__attribute__ ((weak)) void TIM8_UP_TIM13_IRQHandler(void)
{
	while (1);
}

// 0x0f4, 45: TIM8 Trigger and Commutation and TIM14
__attribute__ ((weak)) void TIM8_TRG_COM_TIM14_IRQHandler(void)
{
	while (1);
}

// 0x0f8, 46: TIM8 Capture Compare
__attribute__ ((weak)) void TIM8_CC_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x0fc, 47: DMA1 Stream7
__attribute__ ((weak)) void DMA1_Stream7_IRQHandler(void)
{
	while (1);
}

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

// 0x100, 48: Reserved
__attribute__ ((weak)) void __Reserved_0x100_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x100, 48: FSMC
__attribute__ ((weak)) void FSMC_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F410_VECTORS)

// 0x104, 49: Reserved
__attribute__ ((weak)) void __Reserved_0x104_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F410_VECTORS)

// 0x104, 49: SDIO
__attribute__ ((weak)) void SDIO_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F410_VECTORS)

// 0x108, 50: TIM5
__attribute__ ((weak)) void TIM5_IRQHandler(void)
{
	while (1);
}

#if defined(STM32F410_VECTORS)

// 0x10c, 51: Reserved
__attribute__ ((weak)) void __Reserved_0x10c_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F410_VECTORS)

// 0x10c, 51: SPI3
__attribute__ ((weak)) void SPI3_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

// 0x110, 52: Reserved
__attribute__ ((weak)) void __Reserved_0x110_Handler(void)
{
	while (1);
}

// 0x114, 53: Reserved
__attribute__ ((weak)) void __Reserved_0x114_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x110, 52: UART4
__attribute__ ((weak)) void UART4_IRQHandler(void)
{
	while (1);
}

// 0x114, 53: UART5
__attribute__ ((weak)) void UART5_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS)

// 0x118, 54: Reserved
__attribute__ ((weak)) void __Reserved_0x118_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS)

// 0x118, 54: TIM6 and DAC1&2 underrun error
__attribute__ ((weak)) void TIM6_DAC_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

// 0x11c, 55: Reserved
__attribute__ ((weak)) void __Reserved_0x11c_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x11c, 55: TIM7
__attribute__ ((weak)) void TIM7_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x120, 56: DMA2 Stream 0
__attribute__ ((weak)) void DMA2_Stream0_IRQHandler(void)
{
	while (1);
}

// 0x124, 57: DMA2 Stream 1
__attribute__ ((weak)) void DMA2_Stream1_IRQHandler(void)
{
	while (1);
}

// 0x128, 58: DMA2 Stream 2
__attribute__ ((weak)) void DMA2_Stream2_IRQHandler(void)
{
	while (1);
}

// 0x12c, 59: DMA2 Stream 3
__attribute__ ((weak)) void DMA2_Stream3_IRQHandler(void)
{
	while (1);
}

// 0x130, 60: DMA2 Stream 4
__attribute__ ((weak)) void DMA2_Stream4_IRQHandler(void)
{
	while (1);
}

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

// 0x134, 61: Reserved
__attribute__ ((weak)) void __Reserved_0x134_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x134, 61: Ethernet
__attribute__ ((weak)) void ETH_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS)

// 0x138, 62: Reserved
__attribute__ ((weak)) void __Reserved_0x138_Handler(void)
{
	while (1);
}

#elif defined(STM32F410_VECTORS)

// 0x138, 62: EXTI Line 19
__attribute__ ((weak)) void EXTI19_IRQHandler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x138, 62: Ethernet Wakeup through the EXTI line
__attribute__ ((weak)) void ETH_WKUP_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS)

