DISTORTEC/distortos/source/chip/STMicroelectronics/STM32F4/STM32F4-chipVectors.c
#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

// 0x13c, 63: Reserved
__attribute__ ((weak)) void __Reserved_0x13c_Handler(void)
{
	while (1);
}

// 0x140, 64: Reserved
__attribute__ ((weak)) void __Reserved_0x140_Handler(void)
{
	while (1);
}

// 0x144, 65: Reserved
__attribute__ ((weak)) void __Reserved_0x144_Handler(void)
{
	while (1);
}

// 0x148, 66: Reserved
__attribute__ ((weak)) void __Reserved_0x148_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x13c, 63: CAN2 TX
__attribute__ ((weak)) void CAN2_TX_IRQHandler(void)
{
	while (1);
}

// 0x140, 64: CAN2 RX0
__attribute__ ((weak)) void CAN2_RX0_IRQHandler(void)
{
	while (1);
}

// 0x144, 65: CAN2 RX1
__attribute__ ((weak)) void CAN2_RX1_IRQHandler(void)
{
	while (1);
}

// 0x148, 66: CAN2 SCE
__attribute__ ((weak)) void CAN2_SCE_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F410_VECTORS)

// 0x14c, 67: Reserved
__attribute__ ((weak)) void __Reserved_0x14c_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F410_VECTORS)

// 0x14c, 67: USB OTG FS
__attribute__ ((weak)) void OTG_FS_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F410_VECTORS)

// 0x150, 68: DMA2 Stream 5
__attribute__ ((weak)) void DMA2_Stream5_IRQHandler(void)
{
	while (1);
}

// 0x154, 69: DMA2 Stream 6
__attribute__ ((weak)) void DMA2_Stream6_IRQHandler(void)
{
	while (1);
}

// 0x158, 70: DMA2 Stream 7
__attribute__ ((weak)) void DMA2_Stream7_IRQHandler(void)
{
	while (1);
}

// 0x15c, 71: USART6
__attribute__ ((weak)) void USART6_IRQHandler(void)
{
	while (1);
}

#if defined(STM32F410_VECTORS)

// 0x160, 72: Reserved
__attribute__ ((weak)) void __Reserved_0x160_Handler(void)
{
	while (1);
}

// 0x164, 73: Reserved
__attribute__ ((weak)) void __Reserved_0x164_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F410_VECTORS)

// 0x160, 72: I2C3 event
__attribute__ ((weak)) void I2C3_EV_IRQHandler(void)
{
	while (1);
}

// 0x164, 73: I2C3 error
__attribute__ ((weak)) void I2C3_ER_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

// 0x168, 74: Reserved
__attribute__ ((weak)) void __Reserved_0x168_Handler(void)
{
	while (1);
}

// 0x16c, 75: Reserved
__attribute__ ((weak)) void __Reserved_0x16c_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x168, 74: USB OTG HS End Point 1 Out
__attribute__ ((weak)) void OTG_HS_EP1_OUT_IRQHandler(void)
{
	while (1);
}

// 0x16c, 75: USB OTG HS End Point 1 In
__attribute__ ((weak)) void OTG_HS_EP1_IN_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS)

// 0x170, 76: Reserved
__attribute__ ((weak)) void __Reserved_0x170_Handler(void)
{
	while (1);
}

#elif defined(STM32F410_VECTORS)

// 0x170, 76: EXTI Line 20
__attribute__ ((weak)) void EXTI20_IRQHandler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x170, 76: USB OTG HS Wakeup through the EXTI line
__attribute__ ((weak)) void OTG_HS_WKUP_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

// 0x174, 77: Reserved
__attribute__ ((weak)) void __Reserved_0x174_Handler(void)
{
	while (1);
}

// 0x178, 78: Reserved
__attribute__ ((weak)) void __Reserved_0x178_Handler(void)
{
	while (1);
}

// 0x17c, 79: Reserved
__attribute__ ((weak)) void __Reserved_0x17c_Handler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x174, 77: USB OTG HS
__attribute__ ((weak)) void OTG_HS_IRQHandler(void)
{
	while (1);
}

// 0x178, 78: DCMI
__attribute__ ((weak)) void DCMI_IRQHandler(void)
{
	while (1);
}

// 0x17c, 79: CRYP crypto
__attribute__ ((weak)) void CRYP_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS)

// 0x180, 80: Reserved
__attribute__ ((weak)) void __Reserved_0x180_Handler(void)
{
	while (1);
}

#elif defined(STM32F410_VECTORS)

// 0x180, 80: RNG
__attribute__ ((weak)) void RNG_IRQHandler(void)
{
	while (1);
}

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x180, 80: Hash and RNG
__attribute__ ((weak)) void HASH_RNG_IRQHandler(void)
{
	while (1);
}

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x184, 81: FPU
__attribute__ ((weak)) void FPU_IRQHandler(void)
{
	while (1);
}

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

#	if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

// 0x188, 82: Reserved
__attribute__ ((weak)) void __Reserved_0x188_Handler(void)
{
	while (1);
}

// 0x18c, 83: Reserved
__attribute__ ((weak)) void __Reserved_0x18c_Handler(void)
{
	while (1);
}

#	else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

// 0x188, 82: UART7
__attribute__ ((weak)) void UART7_IRQHandler(void)
{
	while (1);
}

// 0x18c, 83: UART8
__attribute__ ((weak)) void UART8_IRQHandler(void)
{
	while (1);
}

#	endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#	if defined(STM32F410_VECTORS)

// 0x190, 84: Reserved
__attribute__ ((weak)) void __Reserved_0x190_Handler(void)
{
	while (1);
}

#	else	// !defined(STM32F410_VECTORS)

// 0x190, 84: SPI4
__attribute__ ((weak)) void SPI4_IRQHandler(void)
{
	while (1);
}

#	endif	// !defined(STM32F410_VECTORS)

#endif	// defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

#if defined(STM32F410_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

// 0x194, 85: SPI5
__attribute__ ((weak)) void SPI5_IRQHandler(void)
{
	while (1);
}

#	if defined(STM32F410_VECTORS)

// 0x198, 86: Reserved
__attribute__ ((weak)) void __Reserved_0x198_Handler(void)
{
	while (1);
}

// 0x19c, 87: Reserved
__attribute__ ((weak)) void __Reserved_0x19c_Handler(void)
{
	while (1);
}

// 0x1a0, 88: Reserved
__attribute__ ((weak)) void __Reserved_0x1a0_Handler(void)
{
	while (1);
}

