DISTORTEC/distortos/source/chip/STMicroelectronics/STM32F4/STM32F4-chipVectors.c
// 0x1a4, 89: Reserved
__attribute__ ((weak)) void __Reserved_0x1a4_Handler(void)
{
	while (1);
}

// 0x1a8, 90: Reserved
__attribute__ ((weak)) void __Reserved_0x1a8_Handler(void)
{
	while (1);
}

#	else	// !defined(STM32F410_VECTORS)

// 0x198, 86: SPI6
__attribute__ ((weak)) void SPI6_IRQHandler(void)
{
	while (1);
}

// 0x19c, 87: SAI1
__attribute__ ((weak)) void SAI1_IRQHandler(void)
{
	while (1);
}

// 0x1a0, 88: LTDC
__attribute__ ((weak)) void LTDC_IRQHandler(void)
{
	while (1);
}

// 0x1a4, 89: LTDC error
__attribute__ ((weak)) void LTDC_ER_IRQHandler(void)
{
	while (1);
}

// 0x1a8, 90: DMA2D
__attribute__ ((weak)) void DMA2D_IRQHandler(void)
{
	while (1);
}

#	endif	// !defined(STM32F410_VECTORS)

#endif	// defined(STM32F410_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

#if defined(STM32F410_VECTORS)

// 0x1ac, 91: Reserved
__attribute__ ((weak)) void __Reserved_0x1ac_Handler(void)
{
	while (1);
}

// 0x1b0, 92: Reserved
__attribute__ ((weak)) void __Reserved_0x1b0_Handler(void)
{
	while (1);
}

// 0x1b4, 93: Reserved
__attribute__ ((weak)) void __Reserved_0x1b4_Handler(void)
{
	while (1);
}

// 0x1b8, 94: Reserved
__attribute__ ((weak)) void __Reserved_0x1b8_Handler(void)
{
	while (1);
}

// 0x1bc, 95: FMPI2C1 Event
__attribute__ ((weak)) void FMPI2C1_EV_IRQHandler(void)
{
	while (1);
}

// 0x1c0, 96: FMPI2C1 Error
__attribute__ ((weak)) void FMPI2C1_ER_IRQHandler(void)
{
	while (1);
}

// 0x1c4, 97: LPTIM1 through the EXTI line
__attribute__ ((weak)) void LPTIM1_IRQHandler(void)
{
	while (1);
}

#endif	// defined(STM32F410_VECTORS)

/*---------------------------------------------------------------------------------------------------------------------+
| local types
+---------------------------------------------------------------------------------------------------------------------*/

/// single interrupt vector - pointer to function with no arguments and no return value
typedef void (*InterruptVector)(void);

/*---------------------------------------------------------------------------------------------------------------------+
| global variables
+---------------------------------------------------------------------------------------------------------------------*/

/// chip vector table
const InterruptVector chipVectors[] __attribute__ ((section(".chipVectors"))) =
{
		WWDG_IRQHandler,					// 0x040, 0: Window WatchDog
		PVD_IRQHandler,						// 0x044, 1: PVD through EXTI Line detection
		TAMP_STAMP_IRQHandler,				// 0x048, 2: Tamper and TimeStamp through the EXTI line
		RTC_WKUP_IRQHandler,				// 0x04c, 3: RTC Wakeup through the EXTI line
		FLASH_IRQHandler,					// 0x050, 4: FLASH
		RCC_IRQHandler,						// 0x054, 5: RCC
		EXTI0_IRQHandler,					// 0x058, 6: EXTI Line 0
		EXTI1_IRQHandler,					// 0x05c, 7: EXTI Line 1
		EXTI2_IRQHandler,					// 0x060, 8: EXTI Line 2
		EXTI3_IRQHandler,					// 0x064, 9: EXTI Line 3
		EXTI4_IRQHandler,					// 0x068, 10: EXTI Line 4
		DMA1_Stream0_IRQHandler,			// 0x06c, 11: DMA1 Stream 0
		DMA1_Stream1_IRQHandler,			// 0x070, 12: DMA1 Stream 1
		DMA1_Stream2_IRQHandler,			// 0x074, 13: DMA1 Stream 2
		DMA1_Stream3_IRQHandler,			// 0x078, 14: DMA1 Stream 3
		DMA1_Stream4_IRQHandler,			// 0x07c, 15: DMA1 Stream 4
		DMA1_Stream5_IRQHandler,			// 0x080, 16: DMA1 Stream 5
		DMA1_Stream6_IRQHandler,			// 0x084, 17: DMA1 Stream 6
		ADC_IRQHandler,						// 0x088, 18: ADC1, ADC2 and ADC3

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

		__Reserved_0x8c_Handler,			// 0x08c, 19: Reserved
		__Reserved_0x90_Handler,			// 0x090, 20: Reserved
		__Reserved_0x94_Handler,			// 0x094, 21: Reserved
		__Reserved_0x98_Handler,			// 0x098, 22: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		CAN1_TX_IRQHandler,					// 0x08c, 19: CAN1 TX
		CAN1_RX0_IRQHandler,				// 0x090, 20: CAN1 RX0
		CAN1_RX1_IRQHandler,				// 0x094, 21: CAN1 RX1
		CAN1_SCE_IRQHandler,				// 0x098, 22: CAN1 SCE

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		EXTI9_5_IRQHandler,					// 0x09c, 23: EXTI Lines [9:5]
		TIM1_BRK_TIM9_IRQHandler,			// 0x0a0, 24: TIM1 Break and TIM9

#if defined(STM32F410_VECTORS)

		TIM1_UP_IRQHandler,					// 0x0a4, 25: TIM1 Update

#else	// !defined(STM32F410_VECTORS)

		TIM1_UP_TIM10_IRQHandler,			// 0x0a4, 25: TIM1 Update and TIM10

#endif	// !defined(STM32F410_VECTORS)

		TIM1_TRG_COM_TIM11_IRQHandler,		// 0x0a8, 26: TIM1 Trigger and Commutation and TIM11
		TIM1_CC_IRQHandler,					// 0x0ac, 27: TIM1 Capture Compare

#if defined(STM32F410_VECTORS)

		__Reserved_0xb0_Handler,			// 0x0b0, 28: Reserved
		__Reserved_0xb4_Handler,			// 0x0b4, 29: Reserved
		__Reserved_0xb8_Handler,			// 0x0b8, 30: Reserved

#else	// !defined(STM32F410_VECTORS)

		TIM2_IRQHandler,					// 0x0b0, 28: TIM2
		TIM3_IRQHandler,					// 0x0b4, 29: TIM3
		TIM4_IRQHandler,					// 0x0b8, 30: TIM4

#endif	// !defined(STM32F410_VECTORS)

		I2C1_EV_IRQHandler,					// 0x0bc, 31: I2C1 Event
		I2C1_ER_IRQHandler,					// 0x0c0, 32: I2C1 Error
		I2C2_EV_IRQHandler,					// 0x0c4, 33: I2C2 Event
		I2C2_ER_IRQHandler,					// 0x0c8, 34: I2C2 Error
		SPI1_IRQHandler,					// 0x0cc, 35: SPI1
		SPI2_IRQHandler,					// 0x0d0, 36: SPI2
		USART1_IRQHandler,					// 0x0d4, 37: USART1
		USART2_IRQHandler,					// 0x0d8, 38: USART2

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

		__Reserved_0xdc_Handler,			// 0x0dc, 39: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		USART3_IRQHandler,					// 0x0dc, 39: USART3

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		EXTI15_10_IRQHandler,				// 0x0e0, 40: EXTI Lines [15:10]
		RTC_Alarm_IRQHandler,				// 0x0e4, 41: RTC Alarm (A and B) through the EXTI line

#if defined(STM32F410_VECTORS)

		__Reserved_0xe8_Handler,			// 0x0e8, 42: Reserved

#else	// !defined(STM32F410_VECTORS)

		OTG_FS_WKUP_IRQHandler,				// 0x0e8, 42: USB OTG FS Wakeup through the EXTI line

#endif	// !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

