DISTORTEC/distortos/source/chip/STMicroelectronics/STM32F4/STM32F4-chipVectors.c
		__Reserved_0xec_Handler,			// 0x0ec, 43: Reserved
		__Reserved_0xf0_Handler,			// 0x0f0, 44: Reserved
		__Reserved_0xf4_Handler,			// 0x0f4, 45: Reserved
		__Reserved_0xf8_Handler,			// 0x0f8, 46: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		TIM8_BRK_TIM12_IRQHandler,			// 0x0ec, 43: TIM8 Break and TIM12
		TIM8_UP_TIM13_IRQHandler,			// 0x0f0, 44: TIM8 Update and TIM13
		TIM8_TRG_COM_TIM14_IRQHandler,		// 0x0f4, 45: TIM8 Trigger and Commutation and TIM14
		TIM8_CC_IRQHandler,					// 0x0f8, 46: TIM8 Capture Compare

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		DMA1_Stream7_IRQHandler,			// 0x0fc, 47: DMA1 Stream7

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

		__Reserved_0x100_Handler,			// 0x100, 48: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		FSMC_IRQHandler,					// 0x100, 48: FSMC

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F410_VECTORS)

		__Reserved_0x104_Handler,			// 0x104, 49: Reserved

#else	// !defined(STM32F410_VECTORS)

		SDIO_IRQHandler,					// 0x104, 49: SDIO

#endif	// !defined(STM32F410_VECTORS)

		TIM5_IRQHandler,					// 0x108, 50: TIM5

#if defined(STM32F410_VECTORS)

		__Reserved_0x10c_Handler,			// 0x10c, 51: Reserved

#else	// !defined(STM32F410_VECTORS)

		SPI3_IRQHandler,					// 0x10c, 51: SPI3

#endif	// !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

		__Reserved_0x110_Handler,			// 0x110, 52: Reserved
		__Reserved_0x114_Handler,			// 0x114, 53: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		UART4_IRQHandler,					// 0x110, 52: UART4
		UART5_IRQHandler,					// 0x114, 53: UART5

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS)

		__Reserved_0x118_Handler,			// 0x118, 54: Reserved

#else	// !defined(STM32F401_VECTORS)

		TIM6_DAC_IRQHandler,				// 0x118, 54: TIM6 and DAC1&2 underrun error

#endif	// !defined(STM32F401_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

		__Reserved_0x11c_Handler,			// 0x11c, 55: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		TIM7_IRQHandler,					// 0x11c, 55: TIM7

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		DMA2_Stream0_IRQHandler,			// 0x120, 56: DMA2 Stream 0
		DMA2_Stream1_IRQHandler,			// 0x124, 57: DMA2 Stream 1
		DMA2_Stream2_IRQHandler,			// 0x128, 58: DMA2 Stream 2
		DMA2_Stream3_IRQHandler,			// 0x12c, 59: DMA2 Stream 3
		DMA2_Stream4_IRQHandler,			// 0x130, 60: DMA2 Stream 4

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

		__Reserved_0x134_Handler,			// 0x134, 61: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		ETH_IRQHandler,						// 0x134, 61: Ethernet

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS)

		__Reserved_0x138_Handler,			// 0x138, 62: Reserved

#elif defined(STM32F410_VECTORS)

		EXTI19_IRQHandler,					// 0x138, 62: EXTI Line 19

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		ETH_WKUP_IRQHandler,				// 0x138, 62: Ethernet Wakeup through the EXTI line

#endif	// !defined(STM32F401_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

		__Reserved_0x13c_Handler,			// 0x13c, 63: Reserved
		__Reserved_0x140_Handler,			// 0x140, 64: Reserved
		__Reserved_0x144_Handler,			// 0x144, 65: Reserved
		__Reserved_0x148_Handler,			// 0x148, 66: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		CAN2_TX_IRQHandler,					// 0x13c, 63: CAN2 TX
		CAN2_RX0_IRQHandler,				// 0x140, 64: CAN2 RX0
		CAN2_RX1_IRQHandler,				// 0x144, 65: CAN2 RX1
		CAN2_SCE_IRQHandler,				// 0x148, 66: CAN2 SCE

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F410_VECTORS)

		__Reserved_0x14c_Handler,			// 0x14c, 67: Reserved

#else	// !defined(STM32F410_VECTORS)

		OTG_FS_IRQHandler,					// 0x14c, 67: USB OTG FS

#endif	// !defined(STM32F410_VECTORS)

		DMA2_Stream5_IRQHandler,			// 0x150, 68: DMA2 Stream 5
		DMA2_Stream6_IRQHandler,			// 0x154, 69: DMA2 Stream 6
		DMA2_Stream7_IRQHandler,			// 0x158, 70: DMA2 Stream 7
		USART6_IRQHandler,					// 0x15c, 71: USART6

#if defined(STM32F410_VECTORS)

		__Reserved_0x160_Handler,			// 0x160, 72: Reserved
		__Reserved_0x164_Handler,			// 0x164, 73: Reserved

#else	// !defined(STM32F410_VECTORS)

		I2C3_EV_IRQHandler,					// 0x160, 72: I2C3 event
		I2C3_ER_IRQHandler,					// 0x164, 73: I2C3 error

#endif	// !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

		__Reserved_0x168_Handler,			// 0x168, 74: Reserved
		__Reserved_0x16c_Handler,			// 0x16c, 75: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		OTG_HS_EP1_OUT_IRQHandler,			// 0x168, 74: USB OTG HS End Point 1 Out
		OTG_HS_EP1_IN_IRQHandler,			// 0x16c, 75: USB OTG HS End Point 1 In

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS)

		__Reserved_0x170_Handler,			// 0x170, 76: Reserved

#elif defined(STM32F410_VECTORS)

		EXTI20_IRQHandler,					// 0x170, 76: EXTI Line 20

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		OTG_HS_WKUP_IRQHandler,				// 0x170, 76: USB OTG HS Wakeup through the EXTI line

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

		__Reserved_0x174_Handler,			// 0x174, 77: Reserved
		__Reserved_0x178_Handler,			// 0x178, 78: Reserved
		__Reserved_0x17c_Handler,			// 0x17c, 79: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		OTG_HS_IRQHandler,					// 0x174, 77: USB OTG HS
		DCMI_IRQHandler,					// 0x178, 78: DCMI
		CRYP_IRQHandler,					// 0x17c, 79: CRYP crypto

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#if defined(STM32F401_VECTORS)

		__Reserved_0x180_Handler,			// 0x180, 80: Reserved

