DISTORTEC/distortos/source/chip/STMicroelectronics/STM32F4/STM32F4-chipVectors.c
#elif defined(STM32F410_VECTORS)

		RNG_IRQHandler,						// 0x180, 80: RNG

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		HASH_RNG_IRQHandler,				// 0x180, 80: Hash and RNG

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		FPU_IRQHandler,						// 0x184, 81: FPU

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

#	if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS)

		__Reserved_0x188_Handler,			// 0x188, 82: Reserved
		__Reserved_0x18c_Handler,			// 0x18c, 83: Reserved

#	else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

		UART7_IRQHandler,					// 0x188, 82: UART7
		UART8_IRQHandler,					// 0x18c, 83: UART8

#	endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS)

#	if defined(STM32F410_VECTORS)

		__Reserved_0x190_Handler,			// 0x190, 84: Reserved

#	else	// !defined(STM32F410_VECTORS)

		SPI4_IRQHandler,					// 0x190, 84: SPI4

#	endif	// !defined(STM32F410_VECTORS)

#endif	// defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

#if defined(STM32F410_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

		SPI5_IRQHandler,					// 0x194, 85: SPI5

#	if defined(STM32F410_VECTORS)

		__Reserved_0x198_Handler,			// 0x198, 86: Reserved
		__Reserved_0x19c_Handler,			// 0x19c, 87: Reserved
		__Reserved_0x1a0_Handler,			// 0x1a0, 88: Reserved
		__Reserved_0x1a4_Handler,			// 0x1a4, 89: Reserved
		__Reserved_0x1a8_Handler,			// 0x1a8, 90: Reserved

#	else	// !defined(STM32F410_VECTORS)

		SPI6_IRQHandler,					// 0x198, 86: SPI6
		SAI1_IRQHandler,					// 0x19c, 87: SAI1
		LTDC_IRQHandler,					// 0x1a0, 88: LTDC
		LTDC_ER_IRQHandler,					// 0x1a4, 89: LTDC error
		DMA2D_IRQHandler,					// 0x1a8, 90: DMA2D

#	endif	// !defined(STM32F410_VECTORS)

#endif	// defined(STM32F410_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

#if defined(STM32F410_VECTORS)

		__Reserved_0x1ac_Handler,			// 0x1ac, 91: Reserved
		__Reserved_0x1b0_Handler,			// 0x1b0, 92: Reserved
		__Reserved_0x1b4_Handler,			// 0x1b4, 93: Reserved
		__Reserved_0x1b8_Handler,			// 0x1b8, 94: Reserved
		FMPI2C1_EV_IRQHandler,				// 0x1bc, 95: FMPI2C1 Event
		FMPI2C1_ER_IRQHandler,				// 0x1c0, 96: FMPI2C1 Error
		LPTIM1_IRQHandler,					// 0x1c4, 97: LPTIM1 through the EXTI line

#endif	// defined(STM32F410_VECTORS)

};
